W7D2/Jamify/app/controllers/users_controller.rb

    def create
        p 'UsersController#create'
        @new_user = User.new(email: params[:user][:email])
        @new_user.password = params[:user][:password]

        if @new_user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"