FirstRouteController/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 2]]
---
    def show
        @artwork = Artwork.find(params[:id])
        @artworks_shared = User.find(params[:artist_id]).artworks_shared_with_user

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        @artwork = Artwork.find(params[:id])