FirstRouteController/app/controllers/comments_controller.rb

    def index
        if params.has_key?(:user_id)
            @comments = Comment.where(commenter_id: params[:user_id])
            p params
        elsif params.has_key?(:artwork_id)
            @comments = Comment.where(artwork_id: params[:artwork_id])
        else
            @comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."commenter_id" = $1  [["commenter_id", nil]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."commenter_id" = $1  [["commenter_id", 3]]

    def create
        @comment = Comment.new(comment_params)
        if @comment.save
---
INSERT INTO "comments" ("commenter_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["commenter_id", 3], ["artwork_id", 3], ["body", "Nice artwork david"]]

    def destroy
        @comment = Comment.find(params[:id])
        render json: @comment
        @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]