FirstRouteController/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes"
---
    def index
        if params.has_key?(:user)
            render json: Like.select("*").where(user_id: params[:id])
        else
            render json: Like.all