FirstRouteController/app/controllers/users_controller.rb

    def index
        p params
        if params.has_key?(:query)
            render User.find_by(username: params[:query])
        else
            render json: User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "david"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Julia"], ["email", "julia@abc.com"]]

    def update
        @user = User.find(params[:id])

        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "Dave"], ["id", 1]]